<?php 
function removerAcentos($texto) {
    return strtr($texto, [
        'ç' => 'c', 'Ç' => 'C',
        'ã' => 'a', 'Ã' => 'A',
        'á' => 'a', 'Á' => 'A',
        'à' => 'a', 'À' => 'A',
        'â' => 'a', 'Â' => 'A',
        'é' => 'e', 'É' => 'E',
        'è' => 'e', 'È' => 'E',
        'ê' => 'e', 'Ê' => 'E',
        'í' => 'i', 'Í' => 'I',
        'ó' => 'o', 'Ó' => 'O',
        'õ' => 'o', 'Õ' => 'O',
        'ô' => 'o', 'Ô' => 'O',
        'ú' => 'u', 'Ú' => 'U',
        'ü' => 'u', 'Ü' => 'U',
        'ñ' => 'n', 'Ñ' => 'N'
    ]);
}
?>